Revit 2025 API
ItemFactoryBase.NewReferencePlane2 Method
 Creates a new instance of ReferencePlane.
Namespace: Autodesk.Revit.Creation
Assembly: RevitAPI (in RevitAPI.dll) Version: 25.0.0.0 (25.0.0.0)
Syntax
public ReferencePlane NewReferencePlane2(
	XYZ bubbleEnd,
	XYZ freeEnd,
	XYZ thirdPnt,
	View pView
)
Public Function NewReferencePlane2 (
	bubbleEnd As XYZ,
	freeEnd As XYZ,
	thirdPnt As XYZ,
	pView As View
) As ReferencePlane
public:
ReferencePlane^ NewReferencePlane2(
	XYZ^ bubbleEnd,
	XYZ^ freeEnd,
	XYZ^ thirdPnt,
	View^ pView
)
member NewReferencePlane2 :
        bubbleEnd : XYZ *
        freeEnd : XYZ *
        thirdPnt : XYZ *
        pView : View -> ReferencePlane
Parameters
bubbleEnd XYZ
 The bubble end applied to reference plane.
freeEnd XYZ
 The free end applied to reference plane.
thirdPnt XYZ
 A third point needed to define the reference plane.
pView View
 The specific view apply to the Reference plane.
Return Value
ReferencePlane
 The newly created reference plane.
Remarks
The specific view is applied to the Reference plane only for certain view types: LegendDraftingViewDrawingSheet
Example
// Build now data before creation
XYZ bubbleEnd = new XYZ(1, 0, 0);   // bubble end applied to reference plane
XYZ freeEnd = new XYZ(-5, 0, 0);    // free end applied to reference plane
// Third point should not be on the bubbleEnd-freeEnd line
XYZ thirdPnt = new XYZ(0, 15, 0);   // 3rd point to define reference plane
// Create the reference plane in X-Y, applying the active view
ReferencePlane refPlane = document.Create.NewReferencePlane2(bubbleEnd, freeEnd, thirdPnt, document.ActiveView);
' Build now data before creation
Dim bubbleEnd As New XYZ(1, 0, 0)
' bubble end applied to reference plane
Dim freeEnd As New XYZ(-5, 0, 0)
' free end applied to reference plane
' Third point should not be on the bubbleEnd-freeEnd line
Dim thirdPnt As New XYZ(0, 15, 0)
' 3rd point to define reference plane
' Create the reference plane in X-Y, applying the active view
Dim refPlane As ReferencePlane = document.Create.NewReferencePlane2(bubbleEnd, freeEnd, thirdPnt, document.ActiveView)
No code example is currently available or this language may not be supported.
No code example is currently available or this language may not be supported.
See Also
Reference
ItemFactoryBase Class
Autodesk.Revit.Creation Namespace